{
  "backend/main.mo": "Motoko canister implementing blog posts, user profiles, and admin/user authorization with CRUD operations and publish toggling.",
  "feature_evidence.json": "Feature evidence report mapping logo‑related feature IDs to affected frontend files and associated metadata.",
  "frontend-file-summaries.txt": "Text file providing short summaries of major frontend components, pages, and configuration files.",
  "frontend/index.css": "Tailwind base styles defining a warm earth‑tone OKLCH color system for light and dark themes.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes and wrapping the UI with theme and layout providers.",
  "frontend/src/components/auth/AdminGate.tsx": "Component that guards admin routes by checking authentication, profile setup, and admin status.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and query cache clearing on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for first‑time profile creation allowing users to enter and save their name.",
  "frontend/src/components/site/SiteFooter.tsx": "Responsive footer showing the updated logo, navigation links, contact info, and caffeine.ai attribution.",
  "frontend/src/components/site/SiteHeader.tsx": "Responsive site header with logo, navigation links, active state handling, login button, and mobile menu toggle.",
  "frontend/src/components/site/SiteLayout.tsx": "Layout wrapper that renders the header, footer, and main content area.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, stored identities, and client initialization.",
  "frontend/src/hooks/useQueries.ts": "React-query hooks for fetching and mutating blog posts, user profiles, and admin status using the backend actor.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables defining light and dark color themes.",
  "frontend/src/main.tsx": "App entry point that initializes React, react-query, Internet Identity provider, and global styles.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Shows admin stats and navigation cards for managing and creating posts, gated by admin access.",
  "frontend/src/pages/admin/AdminPostEditorPage.tsx": "Form page for creating or editing blog posts with fields, validation, and submit handling.",
  "frontend/src/pages/admin/AdminPostsListPage.tsx": "Lists all posts for admins with publish toggling and links to create or edit posts.",
  "frontend/src/pages/BlogListPage.tsx": "Public blog list page that fetches published posts and displays them with loading and error states.",
  "frontend/src/pages/BlogPostDetailPage.tsx": "Displays a single blog post by slug with loading, error, and not-found states, showing title, date, image, and content.",
  "frontend/src/pages/ContactPage.tsx": "Renders contact information cards and a description of the cafe's services.",
  "frontend/src/pages/HomePage.tsx": "Provides a homepage with hero content, service highlights, and calls to action.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and clear them from the URL or storage.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and plugins for the frontend.",
  "project_state.json": "Defines the project’s current state, features, requirements, and pending feature requests for the village internet cafe blog site."
}